# 21. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
 # *Пример:*

 # - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
 # - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
 # - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
 # - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
 # - список: [], ищем: "123", ответ: -1

my_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
item = "qwe"

print(my_list.index(item, 2))   #с какого индекса поиск 


my_list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
my_str = input("enter podstroku: ")

if my_list.count(my_str) > 1:
    first_index = my_list.index(my_str)
    print(my_list.index(my_str, first_index + 1))
else:
    print(-1)